Detects the usage of SharpChrome.exe and its injected variant when tested in a specific enterpise environment.

Kibana:

eventid:4673 AND privilegelist:SeCreateGlobalPrivilege AND processname:*chrome.exe

Sigma:

title: SharpChrome detection
status: experimental
description: Detects the usage of SharpChrome to extract credentials from the chrome browser.
author: Tom Johansson
date: 2021/02/24
references:
  - https://github.com/djhohnstein/SharpChromium
  - https://github.com/GhostPack/SharpDPAPI
tags:
    - attack.credential_access
    - attack.T1555
logsource:
    category: process_access
    product: windows
    eventid: 4673
detection:
    selection:
        PrivilegeList: 'SeCreateGlobalPrivilege'
        Processname: '*chrome.exe'
    condition: selection
falsepositives:
    - unknown / depends on environment
level: high



